{nc: 80, depth_multiple: 0.33, width_multiple: 0.5, anchors: [[10, 13, 16, 30, 33,
      23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], 
      backbone: [
    [-1, 1, Conv, [64, 6, 2, 2, 1, true, 1.0]], 
    [-1, 1, Conv, [128, 3, 2, None, 1,true, 1.0]], 
    [-1, 3, C3, [128, true, 1, [0.5, 0.5714285714285714], [0.5, 1.0,1.0], 1.0]],

     [-1, 1, Conv, [256, 3, 2, None, 1, true, 1.0]], 
     [-1, 6, C3, [256, true, 1, [0.5, 1.0], [0.125, 0.125, 1.0, 1.0, 1.0, 1.0], 1.0]], 
     
     [-1, 1,Conv, [512, 3, 2, None, 1, true, 1.0]], 
     [-1, 9, C3, [512, true, 1, [0.5, 1.0], [0.3125, 0.1875, 0.0625, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0], 1.0]], 
     [-1, 1, Conv,[1024, 3, 2, None, 1, true, 1.0]], 
     [-1, 3, C3, [1024, true, 1, [0.5, 0.4358974358974359], [0.84375, 1.0, 1.0], 1.0]], 
     [-1, 1, SPPF, [1024, 5, 0.5]]], 
     head: [[-1, 1, Conv, [512, 1, 1, None, 1, true, 1.0]],
      [-1, 1, nn.Upsample, [None, 2, nearest]],
      [[-1, 6], 1, Concat, [1]], 
      [-1, 3, C3, [512, false, 1, [0.5, 0.25], [0.0625, 1.0,   1.0], 1.0]], 
      [-1, 1, Conv, [256, 1, 1, None, 1, true, 1.0]],
      [-1, 1, nn.Upsample,[None, 2, nearest]], 
      [[-1, 4], 1, Concat, [1]],
      [-1, 3, C3, [256, false, 1,[0.5, 0.07692307692307693], [0.125, 1.0, 1.0], 1.0]], 
      [-1, 1, Conv, [256,3, 2, None, 1, true, 1.0]],
      [[-1, 14], 1, Concat, [1]],
      [-1, 3, C3, [512,false, 1, [0.5, 0.037037037037037035], [0.0625, 1.0, 1.0], 1.0]], 
      [-1, 1,Conv, [512, 3, 2, None, 1, true, 1.0]], [[-1, 10], 1, Concat, [1]], 
      [-1, 3, C3, [1024, false, 1, [0.5, 0.11428571428571428], [0.1875, 1.0, 1.0], 1.0]],
    [[17, 20, 23], 1, Detect, [nc, anchors]]], ch: 3}
