# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 3, 2, 1]],  # 0-P1/2
   [-1, 1, GhostBottleneck, [16, 16, 3, 0, 1]], #1

   [-1, 1, GhostBottleneck, [24, 48, 3, 0, 2]], # 2-p2/4 
   [-1, 1, GhostBottleneck, [24, 72, 3, 0, 1]],

   [-1, 1, GhostBottleneck, [40, 72, 5, 0.25, 2]], # 4- p3/8
   [-1, 1, GhostBottleneck, [40, 120, 5, 0.25, 1]],

   [-1, 1, GhostBottleneck, [80, 240, 3, 0, 2]], # 6- p4/16
   [-1, 1, GhostBottleneck, [80, 200, 3, 0, 1]],
   [-1, 1, GhostBottleneck, [80, 184, 3, 0, 1]],
   [-1, 1, GhostBottleneck, [80, 184, 3, 0, 1]],
   [-1, 1, GhostBottleneck, [112, 480, 3, 0.25, 1]],
   [-1, 1, GhostBottleneck, [112, 672, 3, 0.25, 1]],

   [-1, 1, GhostBottleneck, [160, 672, 5, 0.25, 2]], # 12- p5/32
   [-1, 1, GhostBottleneck, [160, 960, 5, 0, 1]],
   [-1, 1, GhostBottleneck, [160, 960, 5, 0.25, 1]],
   [-1, 1, GhostBottleneck, [160, 960, 5, 0, 1]],
   [-1, 1, GhostBottleneck, [160, 960, 5, 0.25, 1]],

   [-1, 1, Conv, [960, 1, 1]],
   [-1, 1, SPPF, [1024, 5]], 
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 20
   [[-1, 11], 1, Concat, [1]],  # cat backbone P4 21
   [-1, 3, C3, [512, False]],  # 

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #24
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 25
   [-1, 3, C3, [256, False]],  # 26 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 23], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 29 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 32 (P5/32-large)

   [[26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

