{nc: 10, depth_multiple: 0.33, width_multiple: 0.5, anchors: [[10, 13, 16, 30, 33,
      23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], backbone: [
    [-1, 1, Conv, [64, 6, 2, 2, 1, true, 1.0]], [-1, 1, Conv, [128, 3, 2, None, 1,
        true, 0.75]], [-1, 3, C3, [128, true, 1, [0.5, 0.375], [0.75, 1.0, 1.0], 0.875]],
    [-1, 1, Conv, [256, 3, 2, None, 1, true, 0.8125]], [-1, 6, C3, [256, true, 1,
        [0.5, 0.5], [0.875, 0.625, 1.0, 1.0, 1.0, 1.0], 0.625]], [-1, 1, Conv, [512,
        3, 2, None, 1, true, 0.6875]], [-1, 9, C3, [512, true, 1, [0.5, 0.34375],
        [1.0, 0.5, 0.875, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0], 0.8125]], [-1, 1, Conv, [
        1024, 3, 2, None, 1, true, 0.65625]], [-1, 3, C3, [1024, true, 1, [0.5, 0.421875],
        [0.8125, 1.0, 1.0], 0.8125]], [-1, 1, SPPF, [1024, 5, 0.28125]]], head: [
    [-1, 1, Conv, [512, 1, 1, None, 1, true, 1.0]], [-1, 1, nn.Upsample, [None, 2,
        nearest]], [[-1, 6], 1, Concat, [1]], [-1, 3, C3, [512, false, 1, [0.5, 0.3125],
        [0.8125, 1.0, 1.0], 0.78125]], [-1, 1, Conv, [256, 1, 1, None, 1, true, 0.9375]],
    [-1, 1, nn.Upsample, [None, 2, nearest]], [[-1, 4], 1, Concat, [1]], [-1, 3, C3,
      [256, false, 1, [0.5, 0.3125], [0.875, 1.0, 1.0], 0.5625]], [-1, 1, Conv, [
        256, 3, 2, None, 1, true, 0.5625]], [[-1, 14], 1, Concat, [1]], [-1, 3, C3,
      [512, false, 1, [0.5, 0.46875], [0.625, 1.0, 1.0], 0.8125]], [-1, 1, Conv, [
        512, 3, 2, None, 1, true, 0.65625]], [[-1, 10], 1, Concat, [1]], [-1, 3, C3,
      [1024, false, 1, [0.5, 0.296875], [0.8125, 1.0, 1.0], 0.921875]], [[17, 20,
        23], 1, Detect, [nc, anchors]]]}
